J1m1-P/Robot-Summer-Team-5/Robot/firmware/esp32-drivetrain/src/control/task/robot_sequence_controller.c
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_DISTANCE}, 0.05f, 0.2f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.05f, 0.2f},
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_EXTEND_LOCATOR}, 0.0f},
    {ROBOT_STEP_DELAY, {0}, 1.7f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_MX_UNTIL_LOCATOR}, 1.0f, 0.15f},
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_RETRACT_LOCATOR}, 0.0f},

    // Placing the tower pieces
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_Z}, -0.35f},                  // lower claw
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_OPEN_MIDDLE_CLAW}, 0.0f},    // drop middle piece
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_Z}, 0.9f},                   // raise claw
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_X}, 0.68f},                  // move X
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_Z}, -0.3f},                 // lower claw
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_OPEN_LEFT_CLAW}, 0.0f},      // drop left piece
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_Z}, 1.35f},                   // raise claw
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_X}, -0.68f},                 // move X
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_X}, -0.68f},                 // move X again
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_Z}, -0.4f},                 // lower claw
    {ROBOT_STEP_ARM, {.arm = CMD_TOWER_OPEN_RIGHT_CLAW}, 0.0f},     // drop right piece
    

    // Go back to main tape and put tower arm and locator in safe idle position 

    // ----------------------------- Habitat Code -----------------------------

    /* Drive from tower base to habitat pickup #1 */
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.8f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.3f, 0.4f},                         // Leave tower base
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, 88.0f, 1.0f},                               // Rotate
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.95f, 0.4f},                        // Move towards habitat pickup
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_PY_UNTIL_FRONT_TAPE}, 0.0f, 0.2f},                // Go back on tape
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_PX_TAPE_FOLLOW_DISTANCE}, 0.05f, 0.2f},              // Short tape follow to not confuse robot
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_PX_TAPE_FOLLOW_UNTIL_ALL_CHANNELS_ON}, 0.0f, 0.2f},  // Tape follow to habitat pickup

    /* Home angle and Y axis motion */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.04f, 0.3f},                   // Back off
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_DISTANCE}, -0.02f, 0.2f},                   // Deliberately move right
    {ROBOT_STEP_DELAY, {0}, 0.2f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_UNTIL_FRONT_CENTER_TAPE}, 0.2f, 0.09f},     // Align front sensor
    {ROBOT_STEP_DELAY, {0}, 0.2f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_MX_TAPE_PIVOT_ALIGN}, 0.0f, 0.2f},               // Align back sensor

    /* Go off the tape and go for the habitats 1 and 2 */ 
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, -6.0f, 0.3f},                           // Angular adjustment
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_PY_DISTANCE}, 0.2f, 0.25f},                   // Move sideways to the habitats

    /* Pick up the habitats 1 and 2 */
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.78f},                                   // lower claw
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.065f, 0.1f},    // Move forward to habitats
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_CLOSE_CLAWS}, 0.0f},                           // Pick up habitats
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.1f},                                    // Raise habitats

    /* Move to the habitat base */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, 145.0f, 1.5f},          // Turn around
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.08f},                                   // Lower habitats
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_TIME}, 2.5f, 0.1f},         // Ram habitat base
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.05f, 0.2f},   // Move back

    /* Placedown habitat 1 */
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.35f},                                    // Raise habitats
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.05f, 0.2f},    // Move forward
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, -0.92f},                                   // Move habitats sideways
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.1f},                                    // Lower habitats
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_OPEN_RIGHT_CLAW}, 0.0f},                       // Drop habitat 1
    {ROBOT_STEP_DELAY, {0}, 0.5f},

    /* Placedown habitat 2*/
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.1f},                                     // Raise habitats
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.02f, 0.15f},   // Move forward
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, 0.92f},                                    // Push habitat
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.02f, 0.15f},  // Move backwards
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, 0.92f},                                    // Move habitat in position
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.1f},                                    // Lower habitats
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_OPEN_LEFT_CLAW}, 0.0f},                        // Drop habitat 2
    {ROBOT_STEP_DELAY, {0}, 0.5f},
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.1f},                                     // Raise habitat claws
    
    /* Rehome the two steppers */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.06f, 0.15f},  // Move away from base
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, -0.92f},                                   // Rehome X
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.41f},                                    // Rehome Z

    /* Go back onto the tape */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_PY_UNTIL_FRONT_TAPE}, 0.0f, 0.2f},            // Go to main tape
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.1f, 0.2f},                     // Move away from pickup
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, 80.0f, 1.5f},                           // Turn halfway
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE_CCW_UNTIL_FRONT_TAPE}, 140.0f, 1.0f},     // Turn onto main tape

