J1m1-P/Robot-Summer-Team-5/Robot/firmware/esp32-drivetrain/src/control/task/robot_sequence_controller.c
    /* Move to habitat pickup #2 */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_PX_TAPE_FOLLOW_UNTIL_ALL_CHANNELS_ON}, 0.0f, 0.15f},  // Slow down for final approach

    /* Home angle and Y axis motion */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.04f, 0.3f},                   // Back off
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_DISTANCE}, -0.02f, 0.2f},                   // Deliberately move right
    {ROBOT_STEP_DELAY, {0}, 0.2f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_UNTIL_FRONT_CENTER_TAPE}, 0.2f, 0.09f},     // Align front sensor
    {ROBOT_STEP_DELAY, {0}, 0.2f},
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_MX_TAPE_PIVOT_ALIGN}, 0.0f, 0.2f},               // Align back sensor

    /* Go off the tape for the habitats 3 and 4*/
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, 15.0f, 0.3f},            // Angular Adjustment
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_PY_DISTANCE}, -0.195f, 0.3f},   // Move sideways to habitats

    /* Pick up the habitats */
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.78f},                                   // lower claw
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.06f, 0.05f},   // Move forward
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_CLOSE_CLAWS}, 0.0f},                           // Close claws
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.1f},                                     // Raise claw

    /* Move to the habitat base with habitats 3 and 4 */
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_DISTANCE}, 0.15f, 0.3f},                        // Avoid solar panel
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -1.0f, 0.4f},                        // Go to other angle
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, 37.0f, 1.0f},                               // Point at base
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.09f},                                                       // lower habitats
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_TIME}, 0.75f, 0.3f},                            // Move forward fast
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_TIME}, 1.75f, 0.1f},                            // Ram habitat base
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.05f, 0.2f},                       // Move back

    /* Placedown habitat 3*/
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.38f},                                        // Raise habitats
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, -0.92f},                                       // Move habitats sideways
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.045f, 0.2f},       // Move forward
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.1f},                                        // Lower habitats
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_OPEN_RIGHT_CLAW}, 0.0f},                           // Drop habitat 3
    {ROBOT_STEP_DELAY, {0}, 0.5f},

    /* Placedown habitat 4*/
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.1f},                                         // Raise habitats
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_DISTANCE}, -0.03f, 0.15f},      // Push habitat 3 with drivetrain
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.07f, 0.15f},      // Back off
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, -40.0f, 0.5f},              // Rotate to face opening
    {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_TIME}, 1.5f, 0.1f},             // Wedge habitat 4 into position
    {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_OPEN_LEFT_CLAW}, 0.0f},                            // Drop habitat 4
    {ROBOT_STEP_DELAY, {0}, 0.5f},
     
    // /*------------------------ Solar Panel Code Below ------------------------*/
    // {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_CLOSE_CLAWS}, 0.0f},
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, -0.25f, 0.4f},           // move back to solar panel
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_ROTATE}, 90.0f, 1.5f},                   // rotate so hook is aligned
    // {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.15f},                                         // move claw to position in Z (individual testing)
    // {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, -0.9f},                                         // move claw to position in X (individual testing)
    // // {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, -0.22f},                                           // move claw to position in Z
    // // {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_X}, -0.3f},                                            // move claw to position in X
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.175f, 0.25f},           // move in front of solar panel
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_PY_UNTIL_SOLAR_PANEL}, 1.0f, 0.2f},   // move left up to 1 m or until the solar-panel switch is pressed
    // {ROBOT_STEP_ARM, {.arm = CMD_HABITAT_Z}, 0.08f},
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_X_DISTANCE}, 0.3f, 0.25f},            // pull solar panel cover away
    // {ROBOT_STEP_MOVEMENT, {.movement = MOVEMENT_ACTION_GO_Y_DISTANCE}, -0.2f, 0.25f},            // pull solar panel cover away
#endif

    // Stationary rock-read test: each read owns its baseline and claw workflow.
    {ROBOT_STEP_ARM, {.arm = CMD_METAL_READ}, 0.0f},
    {ROBOT_STEP_DELAY, {0}, 5.0f},
    {ROBOT_STEP_ARM, {.arm = CMD_METAL_READ}, 0.0f},
    {ROBOT_STEP_DELAY, {0}, 5.0f},
    {ROBOT_STEP_ARM, {.arm = CMD_METAL_READ}, 0.0f},
};

static const size_t kRobotSequenceLength =
    sizeof(kRobotSequence) / sizeof(kRobotSequence[0]);

static bool deadline_reached(uint32_t now_ms, uint32_t deadline_ms) {
    return (int32_t)(now_ms - deadline_ms) >= 0;
}

static bool step_is_movement(RobotStepType type) {
    return type == ROBOT_STEP_MOVEMENT;
}

static bool step_is_delay(RobotStepType type) {
    return type == ROBOT_STEP_DELAY;
}

