J1m1-P/Robot-Summer-Team-5/Robot/firmware/esp32-drivetrain/src/control/task/robot_sequence_controller.c
static bool controller_is_valid(const RobotSequenceController *controller) {
    return controller != NULL &&
           controller->pose_tracker != NULL &&
           controller->drivetrain != NULL &&
           controller->arm_uart != NULL &&
           controller->odometry_link != NULL;
}

static void enter_fault(
    RobotSequenceController *controller,
    const char *reason,
    esp_err_t error) {
    controller->running = false;
    printf(
        "# Robot sequence FAULT at step %u: %s (%s)\n",
        (unsigned)controller->current_step,
        reason,
        esp_err_to_name(error));
}

static esp_err_t start_robot_step(
    RobotSequenceController *controller,
    size_t step_index,
    uint32_t now_ms);

static void advance_sequence(
    RobotSequenceController *controller,
    uint32_t now_ms);

// -------------------------- Incoming UART logic --------------------------

static bool service_pi_report(
    RobotSequenceController *controller,
    const PacketFrame *frame) {
    // Decode the report received from the Pi.
    PiReportPacket report = {0};
    if (pi_report_packet_decode(frame, &report) != ESP_OK) return false;

    // Ignore a stale Pi report unless the sequence is waiting for a scan.
    if (kRobotSequence[controller->current_step].type !=
        ROBOT_STEP_PI_SCAN) {
        return false;
    }

    // Reports are repeated for reliability. Process each request only once.
    if (controller->last_pi_request_id == report.request_id) {
        return false;
    }
    controller->last_pi_request_id = report.request_id;

    // A miss still completes the scan -- nothing more to wait on.
    if (report.result == PI_RESULT_NOT_FOUND) {
        printf("# Pi scan: no Teletubby detected\n");
        return true;
    }

    // Link, camera, and request failures stop the sequence.
    if (report.result != PI_RESULT_OK) {
        enter_fault(controller, "Pi scan failed", ESP_FAIL);
        return false;
    }

    printf("# Pi scan: target %u detected\n", (unsigned)report.target_id);
    return true;
}

// Selects the sequence logic for one non-odometry packet.
static void handle_sequence_frame(
    RobotSequenceController *controller,
    const PacketFrame *frame,
    uint32_t now_ms) {
    if (controller == NULL || frame == NULL || !controller->running) return;

    bool step_complete = false;

    if (pi_report_packet_is(frame)) {
        step_complete = service_pi_report(controller, frame);
    } else if (status_packet_is(frame)) {
        StatusPacket status = {0};
        if (status_packet_decode(frame, &status) != ESP_OK) return;

        const RobotSequenceStep *active_step =
            &kRobotSequence[controller->current_step];
        const bool expecting_arm_completion =
            !controller->waiting_for_arm_ready &&
            active_step->type == ROBOT_STEP_ARM;
        const uint8_t expected_detail = expecting_arm_completion
            ? (uint8_t)arm_action_status_detail(active_step->action.arm)
            : (uint8_t)STATUS_DETAIL_NONE;
        const bool log_status = controller->waiting_for_arm_ready ||
            expecting_arm_completion || status.code == STATUS_FAULT ||
            status.code == STATUS_LOCATOR_CONTACT ||
            status.code == STATUS_SOLAR_PANEL_CONTACT;
        if (log_status) {
        SEQUENCE_DIAGNOSTIC_LOG(
            "# t=%lu Arm status: current_step=%u code=%u detail=%u "
                "waiting_ready=%u expected_detail=%u\n",
                (unsigned long)now_ms,
                (unsigned)controller->current_step,
                (unsigned)status.code,
                (unsigned)status.detail,
                controller->waiting_for_arm_ready ? 1U : 0U,
                (unsigned)expected_detail);
        }

        if (status.code == STATUS_FAULT) {
            SEQUENCE_DIAGNOSTIC_LOG(
                "# t=%lu Arm status FAULT: step=%u code=%u detail=%u\n",
                (unsigned long)now_ms,
                (unsigned)controller->current_step,
                (unsigned)status.code,
                (unsigned)status.detail);
            enter_fault(controller, "arm reported a fault", ESP_FAIL);
            return;
        }

        if (status.code == STATUS_LOCATOR_CONTACT) {
            controller->locator_contact_pending = true;
            movement_action_controller_notify_locator_contact(
                &controller->movement_action_controller);
            return;
        }

        if (status.code == STATUS_SOLAR_PANEL_CONTACT) {
            movement_action_controller_notify_solar_panel_contact(
                &controller->movement_action_controller);
            return;
        }

        if (controller->waiting_for_arm_ready) {
            if (status.detail != STATUS_DETAIL_NONE) {
                SEQUENCE_DIAGNOSTIC_LOG(
                    "# t=%lu Ignored startup completion: detail=%u "
                    "expected=%u\n",
                    (unsigned long)now_ms,
                    (unsigned)status.detail,
                    (unsigned)STATUS_DETAIL_NONE);
                return;
            }

            controller->waiting_for_arm_ready = false;
            const esp_err_t start_error = start_robot_step(
                controller,
                controller->current_step,
                now_ms);
            if (start_error != ESP_OK) {
                enter_fault(
                    controller,
                    "failed to start first robot step",
                    start_error);
            } else {
                SEQUENCE_DIAGNOSTIC_LOG(
                    "# t=%lu Arm ready; robot sequence started at step=%u\n",
                    (unsigned long)now_ms,
                    (unsigned)controller->current_step);
            }
            return;
        }

        const RobotSequenceStep *step =
            &kRobotSequence[controller->current_step];
        const uint8_t step_expected_detail = step->type == ROBOT_STEP_ARM
            ? (uint8_t)arm_action_status_detail(step->action.arm)
            : (uint8_t)STATUS_DETAIL_NONE;
        const bool metal_read_complete =
            step->type == ROBOT_STEP_ARM &&
            step->action.arm == CMD_METAL_READ &&
            status.code == STATUS_ACTION_COMPLETE &&
            (status.detail == STATUS_DETAIL_METAL_DETECTED ||
             status.detail == STATUS_DETAIL_METAL_NOT_DETECTED);
        const bool fixed_detail_complete =
            step->type == ROBOT_STEP_ARM &&
            step->action.arm != CMD_METAL_READ &&
            status.detail == step_expected_detail;
        step_complete = metal_read_complete || fixed_detail_complete;
        if (step->type == ROBOT_STEP_ARM) {
            SEQUENCE_DIAGNOSTIC_LOG(
                "# t=%lu Arm completion %s: step=%u received_detail=%u "
                "expected_detail=%u\n",
                (unsigned long)now_ms,
                step_complete ? "accepted" : "ignored",
                (unsigned)controller->current_step,
                (unsigned)status.detail,
                (unsigned)step_expected_detail);
        }
    } else {
        return;
    }

    if (step_complete) advance_sequence(controller, now_ms);
}

// Drains every currently queued packet. Odometry and sequence messages share
// one UART, so routing happens immediately after each packet is dequeued.
static esp_err_t receive_arm_uart(
    RobotSequenceController *controller,
    uint32_t now_ms) {
    esp_err_t error = uart_link_update(controller->arm_uart);
    if (error != ESP_OK) return error;

    while (uart_link_has_packet(controller->arm_uart)) {
        PacketFrame frame = {0};
        error = uart_link_take_packet(controller->arm_uart, &frame);
        if (error != ESP_OK) return error;

        if (odometry_packet_is(&frame)) {
            odometry_link_ingest(controller->odometry_link, &frame);
        } else {
            handle_sequence_frame(controller, &frame, now_ms);
        }
    }
    return ESP_OK;
}

static esp_err_t update_pose(RobotSequenceController *controller) {
    const DrivetrainWheelCounts wheel_counts =
        drivetrain_get_wheel_counts(controller->drivetrain);
    const OdometryPacket *optical_packet =
        controller->odometry_link->has_packet
            ? &controller->odometry_link->latest
            : NULL;
    return pose_tracker_update(
        controller->pose_tracker, &wheel_counts, optical_packet);
}

static esp_err_t service_inputs(
    RobotSequenceController *controller,
    uint32_t now_ms) {
    const esp_err_t uart_error = receive_arm_uart(controller, now_ms);
    return uart_error == ESP_OK ? update_pose(controller) : uart_error;
}

