J1m1-P/Robot-Summer-Team-5/Robot/firmware/esp32-drivetrain/src/control/task/robot_sequence_controller.c
// -------------------------- Outgoing UART logic --------------------------

static esp_err_t send_arm_command(
    RobotSequenceController *controller,
    CommandOpcode opcode,
    float value) {
    const CommandPacket command = {
        .opcode = opcode,
        .value = value,
    };
    return command_packet_send(controller->arm_uart, &command);
}

// --------------------------- Sequence logic ------------------------------

static esp_err_t start_robot_step(
    RobotSequenceController *controller,
    size_t step_index,
    uint32_t now_ms) {
    const RobotSequenceStep *step = &kRobotSequence[step_index];
    esp_err_t error = ESP_OK;

    SEQUENCE_DIAGNOSTIC_LOG(
        "# t=%lu Sequence step start: index=%u type=%u action=%u "
        "value=%.3f speed=%.3f deadline_in_ms=%u\n",
        (unsigned long)now_ms,
        (unsigned)step_index,
        (unsigned)step->type,
        step->type == ROBOT_STEP_MOVEMENT
            ? (unsigned)step->action.movement
            : (unsigned)step->action.arm,
        step->action_value,
        step->action_speed_mps,
        step_is_delay(step->type)
            ? (unsigned)(step->action_value * 1000.0f)
            : (unsigned)kActionTimeoutMs);

    controller->step_started_ms = now_ms;

    if (step_is_delay(step->type)) {
        if (!isfinite(step->action_value) || step->action_value < 0.0f ||
            step->action_value > (float)UINT32_MAX / 1000.0f) {
            return ESP_ERR_INVALID_ARG;
        }
        controller->step_deadline_ms = now_ms +
            (uint32_t)(step->action_value * 1000.0f);
        controller->running = true;
        SEQUENCE_DIAGNOSTIC_LOG(
            "# t=%lu Calibration delay started: %.1f seconds\n",
            (unsigned long)now_ms,
            step->action_value);
        return ESP_OK;
    }

    if (step_is_movement(step->type)) {
        error = movement_action_controller_init_with_speed(
            &controller->movement_action_controller,
            step->action.movement,
            step->action_value,
            step->action_speed_mps);
        if (error == ESP_OK &&
            step->action.movement ==
                MOVEMENT_ACTION_GO_MX_UNTIL_LOCATOR &&
            controller->locator_contact_pending) {
            movement_action_controller_notify_locator_contact(
                &controller->movement_action_controller);
            controller->locator_contact_pending = false;
        }
    } else {
        if (step->action.arm == CMD_TOWER_EXTEND_LOCATOR) {
            controller->locator_contact_pending = false;
        }
        SEQUENCE_DIAGNOSTIC_LOG(
            "# t=%lu Arm command send: step=%u opcode=%u value=%.3f\n",
            (unsigned long)now_ms,
            (unsigned)step_index,
            (unsigned)step->action.arm,
            step->action_value);
        error = send_arm_command(
            controller, step->action.arm, step->action_value);
    }
    if (error != ESP_OK) return error;

    controller->step_deadline_ms = now_ms + kActionTimeoutMs;
    controller->running = true;
    return ESP_OK;
}

static void advance_sequence(
    RobotSequenceController *controller,
    uint32_t now_ms) {
    const size_t completed_step = controller->current_step;
    const uint32_t elapsed_ms = now_ms - controller->step_started_ms;
    ++controller->current_step;
    if (controller->current_step >= kRobotSequenceLength) {
        controller->running = false;
    SEQUENCE_DIAGNOSTIC_LOG(
        "# t=%lu Robot sequence complete: final_step=%u elapsed_ms=%u\n",
            (unsigned long)now_ms,
            (unsigned)completed_step,
            (unsigned)elapsed_ms);
        return;
    }

    SEQUENCE_DIAGNOSTIC_LOG(
        "# t=%lu Sequence advance: completed_step=%u elapsed_ms=%u "
        "next_step=%u\n",
        (unsigned long)now_ms,
        (unsigned)completed_step,
        (unsigned)elapsed_ms,
        (unsigned)controller->current_step);

    const esp_err_t error =
        start_robot_step(controller, controller->current_step, now_ms);
    if (error != ESP_OK) {
        enter_fault(controller, "failed to start next robot step", error);
    }
}

esp_err_t robot_sequence_controller_init(
    RobotSequenceController *controller,
    PoseTracker *pose_tracker,
    Drivetrain *drivetrain,
    UartLink *arm_uart,
    Pmw3610OdometryLink *odometry_link) {
    if (controller == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    *controller = (RobotSequenceController){0};
    controller->pose_tracker = pose_tracker;
    controller->drivetrain = drivetrain;
    controller->arm_uart = arm_uart;
    controller->odometry_link = odometry_link;
    if (!controller_is_valid(controller)) {
        *controller = (RobotSequenceController){0};
        return ESP_ERR_INVALID_ARG;
    }
    controller->waiting_for_arm_ready = true;
    controller->running = true;
    printf("# Waiting for arm controller\n");
    return ESP_OK;
}

esp_err_t robot_sequence_controller_start(
    RobotSequenceController *controller,
    uint32_t now_ms) {
    if (controller == NULL || !controller->running) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!controller->waiting_for_arm_ready) return ESP_ERR_INVALID_STATE;

    controller->waiting_for_arm_ready = false;
    const esp_err_t error = start_robot_step(
        controller, controller->current_step, now_ms);
    if (error != ESP_OK) controller->waiting_for_arm_ready = true;
    return error;
}

esp_err_t robot_sequence_controller_update(
    RobotSequenceController *controller,
    uint32_t now_ms) {
    if (!controller_is_valid(controller)) return ESP_ERR_INVALID_ARG;

    // Always service communication and pose, even after the sequence stops.
    const esp_err_t service_error = service_inputs(controller, now_ms);
    if (service_error != ESP_OK) return service_error;

    // Blocking precision moves re-enter this update every 5 ms, so polling
    // here makes the local microswitch part of the same control cycle.
    movement_action_controller_poll_solar_panel_contact(
        &controller->movement_action_controller);

    // A blocking movement calls this function from its own control loop.
    // That nested call services inputs above, then stops here.
    if (!controller->running ||
        controller->waiting_for_arm_ready ||
        controller->updating_movement) {
        return ESP_OK;
    }

