J1m1-P/Robot-Summer-Team-5/Robot/firmware/esp32-drivetrain/src/control/task/robot_sequence_controller.c
    // Choose the update logic for the active step.
    const RobotSequenceStep *step =
        &kRobotSequence[controller->current_step];
    if (step_is_delay(step->type)) {
        if (deadline_reached(now_ms, controller->step_deadline_ms)) {
            advance_sequence(controller, now_ms);
        }
        return ESP_OK;
    }
    if (step_is_movement(step->type)) {
        controller->updating_movement = true;
        const bool succeeded = movement_action_controller_update(
            &controller->movement_action_controller);
        controller->updating_movement = false;
        const uint32_t completion_ms = millis();

        if (succeeded) {
            SEQUENCE_DIAGNOSTIC_LOG(
                "# t=%lu Movement complete: step=%u action=%u elapsed_ms=%u\n",
                (unsigned long)completion_ms,
                (unsigned)controller->current_step,
                (unsigned)step->action.movement,
                (unsigned)(completion_ms - controller->step_started_ms));
            advance_sequence(controller, completion_ms);
        } else if (controller->running) {
            // false is always a terminal failure (no repeats)
            SEQUENCE_DIAGNOSTIC_LOG(
                "# t=%lu Movement failed: step=%u action=%u elapsed_ms=%u\n",
                (unsigned long)completion_ms,
                (unsigned)controller->current_step,
                (unsigned)step->action.movement,
                (unsigned)(completion_ms - controller->step_started_ms));
            enter_fault(controller, "robot step failed", ESP_FAIL);
        }
        return ESP_OK;
    }

    if (deadline_reached(now_ms, controller->step_deadline_ms)) {
        SEQUENCE_DIAGNOSTIC_LOG(
            "# t=%lu Sequence step timeout: index=%u type=%u elapsed_ms=%u "
            "deadline_ms=%lu\n",
            (unsigned long)now_ms,
            (unsigned)controller->current_step,
            (unsigned)step->type,
            (unsigned)(now_ms - controller->step_started_ms),
            (unsigned long)controller->step_deadline_ms);
        enter_fault(controller, "robot step timed out", ESP_ERR_TIMEOUT);
    }
    return ESP_OK;
}
